ImperialSpaceSociety/picotracker-Lora/Current Tracker Prototype/firmware/st example/STM32CubeFunctionPack_LORA1_V2.1.1/Drivers/BSP/Components/lis2dw12/lis2dw12_reg.h
typedef enum {
  LIS2DW12_HIGH_PERFORMANCE                    = 0x04,
  LIS2DW12_CONT_LOW_PWR_4                      = 0x03,
  LIS2DW12_CONT_LOW_PWR_3                      = 0x02,
  LIS2DW12_CONT_LOW_PWR_2                      = 0x01,
  LIS2DW12_CONT_LOW_PWR_12bit                  = 0x00,
  LIS2DW12_SINGLE_LOW_PWR_4                    = 0x0B,
  LIS2DW12_SINGLE_LOW_PWR_3                    = 0x0A,
  LIS2DW12_SINGLE_LOW_PWR_2                    = 0x09,
  LIS2DW12_SINGLE_LOW_PWR_12bit                = 0x08,
  LIS2DW12_HIGH_PERFORMANCE_LOW_NOISE          = 0x14,
  LIS2DW12_CONT_LOW_PWR_LOW_NOISE_4            = 0x13,
  LIS2DW12_CONT_LOW_PWR_LOW_NOISE_3            = 0x12,
  LIS2DW12_CONT_LOW_PWR_LOW_NOISE_2            = 0x11,
  LIS2DW12_CONT_LOW_PWR_LOW_NOISE_12bit        = 0x10,
  LIS2DW12_SINGLE_LOW_PWR_LOW_NOISE_4          = 0x1B,
  LIS2DW12_SINGLE_LOW_PWR_LOW_NOISE_3          = 0x1A,
  LIS2DW12_SINGLE_LOW_PWR_LOW_NOISE_2          = 0x19,
  LIS2DW12_SINGLE_LOW_LOW_NOISE_PWR_12bit      = 0x18,
} lis2dw12_mode_t;
int32_t lis2dw12_power_mode_set(lis2dw12_ctx_t *ctx, lis2dw12_mode_t val);
int32_t lis2dw12_power_mode_get(lis2dw12_ctx_t *ctx, lis2dw12_mode_t *val);

typedef enum {
  LIS2DW12_XL_ODR_OFF            = 0x00,
  LIS2DW12_XL_ODR_1Hz6_LP_ONLY   = 0x01,
  LIS2DW12_XL_ODR_12Hz5          = 0x02,
  LIS2DW12_XL_ODR_25Hz           = 0x03,
  LIS2DW12_XL_ODR_50Hz           = 0x04,
  LIS2DW12_XL_ODR_100Hz          = 0x05,
  LIS2DW12_XL_ODR_200Hz          = 0x06,
  LIS2DW12_XL_ODR_400Hz          = 0x07,
  LIS2DW12_XL_ODR_800Hz          = 0x08,
  LIS2DW12_XL_ODR_1k6Hz          = 0x09,
  LIS2DW12_XL_SET_SW_TRIG        = 0x10,  /* Use this only in SINGLE mode */
  LIS2DW12_XL_SET_PIN_TRIG       = 0x20,  /* Use this only in SINGLE mode */
} lis2dw12_odr_t;
int32_t lis2dw12_data_rate_set(lis2dw12_ctx_t *ctx, lis2dw12_odr_t val);
int32_t lis2dw12_data_rate_get(lis2dw12_ctx_t *ctx, lis2dw12_odr_t *val);

int32_t lis2dw12_block_data_update_set(lis2dw12_ctx_t *ctx, uint8_t val);
int32_t lis2dw12_block_data_update_get(lis2dw12_ctx_t *ctx, uint8_t *val);

typedef enum {
  LIS2DW12_2g     = 0,
  LIS2DW12_4g     = 1,
  LIS2DW12_8g     = 2,
  LIS2DW12_16g    = 3,
} lis2dw12_fs_t;
int32_t lis2dw12_full_scale_set(lis2dw12_ctx_t *ctx, lis2dw12_fs_t val);
int32_t lis2dw12_full_scale_get(lis2dw12_ctx_t *ctx, lis2dw12_fs_t *val);

int32_t lis2dw12_status_reg_get(lis2dw12_ctx_t *ctx, lis2dw12_status_t *val);

int32_t lis2dw12_flag_data_ready_get(lis2dw12_ctx_t *ctx, uint8_t *val);

typedef struct{
  lis2dw12_status_dup_t   status_dup;
  lis2dw12_wake_up_src_t  wake_up_src;
  lis2dw12_tap_src_t      tap_src;
  lis2dw12_sixd_src_t     sixd_src;
  lis2dw12_all_int_src_t  all_int_src;
} lis2dw12_all_sources_t;
int32_t lis2dw12_all_sources_get(lis2dw12_ctx_t *ctx,
                                 lis2dw12_all_sources_t *val);

int32_t lis2dw12_usr_offset_x_set(lis2dw12_ctx_t *ctx, uint8_t *buff);
int32_t lis2dw12_usr_offset_x_get(lis2dw12_ctx_t *ctx, uint8_t *buff);

int32_t lis2dw12_usr_offset_y_set(lis2dw12_ctx_t *ctx, uint8_t *buff);
int32_t lis2dw12_usr_offset_y_get(lis2dw12_ctx_t *ctx, uint8_t *buff);

int32_t lis2dw12_usr_offset_z_set(lis2dw12_ctx_t *ctx, uint8_t *buff);
int32_t lis2dw12_usr_offset_z_get(lis2dw12_ctx_t *ctx, uint8_t *buff);

typedef enum {
  LIS2DW12_LSb_977ug    = 0,
  LIS2DW12_LSb_15mg6    = 1,
} lis2dw12_usr_off_w_t;
int32_t lis2dw12_offset_weight_set(lis2dw12_ctx_t *ctx,
                                      lis2dw12_usr_off_w_t val);
int32_t lis2dw12_offset_weight_get(lis2dw12_ctx_t *ctx,
                                      lis2dw12_usr_off_w_t *val);

int32_t lis2dw12_temperature_raw_get(lis2dw12_ctx_t *ctx, uint8_t *buff);

int32_t lis2dw12_acceleration_raw_get(lis2dw12_ctx_t *ctx, uint8_t *buff);

int32_t lis2dw12_device_id_get(lis2dw12_ctx_t *ctx, uint8_t *buff);

int32_t lis2dw12_auto_increment_set(lis2dw12_ctx_t *ctx, uint8_t val);
int32_t lis2dw12_auto_increment_get(lis2dw12_ctx_t *ctx, uint8_t *val);

int32_t lis2dw12_reset_set(lis2dw12_ctx_t *ctx, uint8_t val);
int32_t lis2dw12_reset_get(lis2dw12_ctx_t *ctx, uint8_t *val);

int32_t lis2dw12_boot_set(lis2dw12_ctx_t *ctx, uint8_t val);
int32_t lis2dw12_boot_get(lis2dw12_ctx_t *ctx, uint8_t *val);

typedef enum {
  LIS2DW12_XL_ST_DISABLE      = 0,
  LIS2DW12_XL_ST_POSITIVE     = 1,
  LIS2DW12_XL_ST_NEGATIVE     = 2,
} lis2dw12_st_t;
int32_t lis2dw12_self_test_set(lis2dw12_ctx_t *ctx, lis2dw12_st_t val);
int32_t lis2dw12_self_test_get(lis2dw12_ctx_t *ctx, lis2dw12_st_t *val);

typedef enum {
  LIS2DW12_DRDY_LATCHED   = 0,
  LIS2DW12_DRDY_PULSED    = 1,
} lis2dw12_drdy_pulsed_t;
int32_t lis2dw12_data_ready_mode_set(lis2dw12_ctx_t *ctx,
                                     lis2dw12_drdy_pulsed_t val);
int32_t lis2dw12_data_ready_mode_get(lis2dw12_ctx_t *ctx,
                                     lis2dw12_drdy_pulsed_t *val);

typedef enum {
  LIS2DW12_LPF_ON_OUT         = 0x00,
  LIS2DW12_USER_OFFSET_ON_OUT  = 0x01,    
  LIS2DW12_HIGH_PASS_ON_OUT    = 0x10,
} lis2dw12_fds_t;
int32_t lis2dw12_filter_path_set(lis2dw12_ctx_t *ctx, lis2dw12_fds_t val);
int32_t lis2dw12_filter_path_get(lis2dw12_ctx_t *ctx, lis2dw12_fds_t *val);

typedef enum {
  LIS2DW12_ODR_DIV_2     = 0,
  LIS2DW12_ODR_DIV_4     = 1,
  LIS2DW12_ODR_DIV_10    = 2,
  LIS2DW12_ODR_DIV_20    = 3,
} lis2dw12_bw_filt_t;
int32_t lis2dw12_filter_bandwidth_set(lis2dw12_ctx_t *ctx,
                                         lis2dw12_bw_filt_t val);
int32_t lis2dw12_filter_bandwidth_get(lis2dw12_ctx_t *ctx,
                                         lis2dw12_bw_filt_t *val);

int32_t lis2dw12_reference_mode_set(lis2dw12_ctx_t *ctx, uint8_t val);
int32_t lis2dw12_reference_mode_get(lis2dw12_ctx_t *ctx, uint8_t *val);

typedef enum {
  LIS2DW12_SPI_4_WIRE   = 0,
  LIS2DW12_SPI_3_WIRE   = 1,
} lis2dw12_sim_t;
int32_t lis2dw12_spi_mode_set(lis2dw12_ctx_t *ctx, lis2dw12_sim_t val);
int32_t lis2dw12_spi_mode_get(lis2dw12_ctx_t *ctx, lis2dw12_sim_t *val);

typedef enum {
  LIS2DW12_I2C_ENABLE    = 0,
  LIS2DW12_I2C_DISABLE   = 1,
} lis2dw12_i2c_disable_t;
int32_t lis2dw12_i2c_interface_set(lis2dw12_ctx_t *ctx,
                                   lis2dw12_i2c_disable_t val);
int32_t lis2dw12_i2c_interface_get(lis2dw12_ctx_t *ctx,
                                   lis2dw12_i2c_disable_t *val);

